---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.StairsEndConnectionType.StraightCut
enum: Autodesk.Revit.DB.Architecture.StairsEndConnectionType
source: html/ee49018e-53f1-4b3d-c760-8e7f07c4e6f5.htm
---
# Autodesk.Revit.DB.Architecture.StairsEndConnectionType.StraightCut

The run and landing are joined by a straight cut.